app/controllers/registrations_controller.rb

	def create
	    #complete this method
			user = User.create(
					name: params[:registrations][:name],
					last_name: params[:registrations][:last_name],
					email: params[:registrations][:email],
					phone: params[:registrations][:phone],
					password: params[:registrations][:password])
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)