app/controllers/sessions_controller.rb

	def create
		#complete this method
		@user = User.where(password: params[:session][:password], email: params[:session][:email])[0]
---
SELECT "users".* FROM "users" WHERE "users"."password" = ? AND "users"."email" = ?  [["password", "2312"], ["email", "hola@l.com"]]