app/controllers/users_controller.rb

  def create
    #complete this method
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    #complete this method
    puts "-------------- update ------------"
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Alberto"], ["last_name", "Plaza"], ["updated_at", "2019-04-19 18:22:06.312693"], ["id", 6]]